web/release-log.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Clojure Box Release Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-12-22 09:48:49 "/>
<meta name="author" content="Shawn Hoover"/>

<link rel="stylesheet" type="text/css" href="styles.css" />
</head><body>
<h1 class="title">Clojure Box Release Notes</h1>

<p><a href="index.html">Clojure Box Home</a> + <a href="releases">All Releases</a>
</p>


<style type="text/css">
  /* hide the generated h1.title so I can put a link at the top
     (and then I have to add a replacement title) */
  h1.title { display: none; }

  /* override the cleaner front page style */
  li {list-style-type:disc;}

  h3 {margin:15px 0px 0px 0px;
</style>

<h1 style="text-align:center;">Clojure Box Release Notes</h1>


<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">1.1RC1 </h3>
<div id="text-1">


<ul>
<li>
Built with Clojure sources from the github 1.1.x branch. Contrib is from
github source at be33acd8. clojure-mode, swank-clojure, and slime are from
github.com/technomancy as of December 19, 2009.

</li>
<li>
Updated EmacsW32: Emacs-23-CvsP091103-EmacsW32-1.58.exe.

</li>
<li>
Patched swank-clojure:
<ul>
<li>
Prevent REPL hang on startup on XP (it would hang until the user pressed
Enter).
</li>
<li>
Fix Find Definition to work with Windows pathnames.


</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">1.0 </h3>
<div id="text-2">


<ul>
<li>
Built with the official 1.0 release from clojure.org. Contrib is from source
at svn r774. clojure-mode, swank-clojure, and slime are updated from git as
of May 9, 2009.

</li>
<li>
Added shortcuts to the README and post-install documents.

</li>
<li>
Included paredit.el. Users still have to activate it themselves.

</li>
<li>
Fixed README customization example for swank-clojure-extra-classpaths.

</li>
<li>
Fixed REPL shortcut to use the release clojure-X.jar.

</li>
<li>
Documented how to select a 64-bit JDK on Vista 64.

</li>
<li>
Patched swank-clojure:
<ul>
<li>
Prevent REPL hang on startup on XP (it would hang until the user pressed
Enter).
</li>
<li>
Fix Find Definition to work with Windows pathnames.


</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">20090320 </h3>
<div id="text-3">


<ul>
<li>
Built with the official 20090320 release from clojure.org. Contrib is from
source at svn r613. clojure-mode and swank-clojure have not been updated.

</li>
<li>
Patched swank-clojure:
<ul>
<li>
Prevent REPL hang on startup on XP (it would hang until the user pressed
Enter).
</li>
<li>
Fix Find Definition to work with Windows pathnames.


</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">r1327.1 </h3>
<div id="text-4">


<ul>
<li>
Fixed default.el to load clojure-mode instead of clojure-auto, which is no
longer part of clojure-mode.

</li>
<li>
Patched swank-clojure:
<ul>
<li>
Prevent REPL hang on startup on XP (it would hang until the user pressed
Enter).
</li>
<li>
Fix Find Definition to work with Windows pathnames.


</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-3">
<h3 id="sec-5">r1327 </h3>
<div id="text-5">


<ul>
<li>
Upgraded components. This is lazier Clojure.

</li>
<li>
Patched swank-clojure so the REPL doesn't hang until the user presses enter
on XP.


</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-3">
<h3 id="sec-6">r1235 </h3>
<div id="text-6">


<ul>
<li>
Upgraded components.

</li>
<li>
Patched swank-clojure so the REPL doesn't hang until the user presses enter
on XP.

</li>
<li>
Added repl startup hook to indent Clojure code.


</li>
</ul>
</div>

</div>

<div id="outline-container-7" class="outline-3">
<h3 id="sec-7">r1142 </h3>
<div id="text-7">


<ul>
<li>
Upgraded components.

</li>
<li>
Added a REPL shortcut.


</li>
</ul>
</div>

</div>

<div id="outline-container-8" class="outline-3">
<h3 id="sec-8">r1109.1 </h3>
<div id="text-8">


<ul>
<li>
Fixed swank-clojure-extra-classpaths so swank can add jars from ~/.clojure
to the classpath.

</li>
<li>
Added post-install instructions with basic emacs tips.

</li>
<li>
Added attribution URLs to the installer README.

</li>
<li>
Changed post-install to run runemacs instead of emacsclientw in an attempt
to fix a reported hang.

</li>
<li>
Moved site-start.el to default.el per emacs recommendations (so user can
override by setting inhibit-default-init in .emacs.

</li>
<li>
Fixed inhibit-splash-screen by setting it in after-init-hook. Now all the
shortcuts don't have to set &ndash;no-splash all the time.


</li>
</ul>
</div>

</div>

<div id="outline-container-9" class="outline-3">
<h3 id="sec-9">r1109 </h3>
<div id="text-9">


<p>
Initial release.
</p>




<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." :
"http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost +
"google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
try {
var pageTracker = _gat._getTracker("UA-11886472-1");
pageTracker._trackPageview();
} catch(err) {}</script>
</div>
</div>
<div id="postamble"></div></body>
</html>
